// Task 02

// Створіть анонімний модуль, який реалізує функцію, що отримує три цілі числа як аргумент та повертає найбільше з них.
// Якщо всі числа однакові — функція повертає будь-яке з них.

// У цьому та подальших завданнях діє правило FairPlay — під час перевірки завжди передаватимуться всі аргументи,
// і вони будуть цілими числами (для цього завдання).

// Якщо буде потрібно додавати додаткові перевірки — це буде вказано в умові.

export default (...args) => {
  if (args[0] === args[1] && args[1] === args[2]) {
    const index = Math.floor(Math.random() * args.length);
    return args[index];
  }
  return Math.max(...args);
};
